In [3]:
import pandas as pd

In [4]:
data=[['juan',36],['pedro',47]]
                   
df = pd.DataFrame(data, columns=['Nombre','Edad']) 

type(df)

pandas.core.frame.DataFrame

In [5]:
data= {
    'Nombre': ['Juan', 'Pedro'],
    'Edad': [36, 47]

}
df = pd.DataFrame(data)

df

  Nombre  Edad
0   Juan    36
1  Pedro    47

In [6]:
df = pd.read_csv('./data/data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [8]:
df=pd.read_csv('./data/data'sep='*')
df

SyntaxError: invalid syntax. Perhaps you forgot a comma? (520034513.py, line 1)

In [10]:
df = pd.read_csv('./data/data_without_header', header=None, names =['nombre','edad', 'ciudad'])
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [11]:
df=pd.read_json('./data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [15]:
df.head(1)

  nombre  edad  ciudad
0   Juan    25  Madrid

In [16]:
df.tail(2)

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [17]:
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nombre  3 non-null      object
 1   edad    3 non-null      int64
 2   ciudad  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [19]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [20]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [21]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [25]:
type (df['nombre'])

pandas.core.series.Series

In [24]:
df[['nombre','edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [27]:
df.loc[2]

nombre      Pedro
edad           35
ciudad    Sevilla
Name: 2, dtype: object

In [28]:
df.loc[[0,2]]

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [29]:
df[df['edad']>25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [46]:
data = {
     'grupo':['A','B','A','B','A','B'],
     'anio' : [2001,2002,2001,2002,2003,2003],
     'valor': [25,30,50,35,15,40]
     
    }

df = pd.DataFrame(data)

In [32]:
df.groupby('grupo').mean()

       valor
grupo
A       30.0
B       35.0

In [49]:
sum = df.groupby(['grupo','anio']).sum()

sum.index

MultiIndex([('A', 2001),
            ('A', 2003),
            ('B', 2002),
            ('B', 2003)],
           names=['grupo', 'anio'])

In [51]:
sum = df.groupby(['grupo','anio']).sum()

sum.reset_index()

  grupo  anio  valor
0     A  2001     75
1     A  2003     15
2     B  2002     65
3     B  2003     40

In [36]:
df.groupby('grupo').min()

       valor
grupo
A         15
B         30

In [52]:
df.groupby(['grupo','valor'  ]).mean()

               anio
grupo valor
A     15     2003.0
      25     2001.0
      50     2001.0
B     30     2002.0
      35     2002.0
      40     2003.0

In [57]:
df['count']= 1
sum = df.groupby(['grupo','anio','valor']).count()

sum.reset_index()

  grupo  anio  valor  count
0     A  2001     25      1
1     A  2001     50      1
2     A  2003     15      1
3     B  2002     30      1
4     B  2002     35      1
5     B  2003     40      1

In [62]:
#como usar una funcion en un dta frame

def funcion1(n):
    return 3*n

funcion1(5)

15

In [63]:
data = {

'A':[1,2,4,6,7],
'B':[3,5,9,8,10]

}

df = pd.DataFrame(data)

In [64]:
df['A_doble']=df['A'].apply(lambda x: x*2)
df

   A   B  A_doble
0  1   3        2
1  2   5        4
2  4   9        8
3  6   8       12
4  7  10       14

In [65]:
def duplicar(n):
    return 2*n

df['B_doble']=df['B'].apply(duplicar)

df

   A   B  A_doble  B_doble
0  1   3        2        6
1  2   5        4       10
2  4   9        8       18
3  6   8       12       16
4  7  10       14       20

In [69]:
df['suma'] = df.apply(lambda row: row['A'] +row['B'],axis=1)
df

   A   B  A_doble  B_doble  suma
0  1   3        2        6     4
1  2   5        4       10     7
2  4   9        8       18    13
3  6   8       12       16    14
4  7  10       14       20    17

In [74]:
def suma(row):
   return row['A'] + row['B'] 

df['suma_2'] = df.apply(suma,axis=1)
df

   A   B  A_doble  B_doble  suma  suma_2
0  1   3        2        6     4       4
1  2   5        4       10     7       7
2  4   9        8       18    13      13
3  6   8       12       16    14      14
4  7  10       14       20    17      17